app/controllers/items_controller.rb

  def index

    order = {score: :desc}

    @items = Item.order(order).includes(:user)

    @votes = @items.includes(:votes).each_with_object({}) do |item, object|
---
SELECT "items".* FROM "items"  ORDER BY "items"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
SELECT "items".* FROM "items"  ORDER BY "items"."votes" DESC

  def newest

    order = {created_at: :desc}

    @items = Item.order(order).includes(:user)
---
SELECT "items".* FROM "items"  ORDER BY "items"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (6, 1)

  def show
    @comments = @item.comments.includes(:user).order(created_at: :asc)
---
SELECT "item_comments".* FROM "item_comments" WHERE "item_comments"."item_id" = $1  ORDER BY "item_comments"."created_at" ASC  [["item_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)

  def create
    @item = current_user.items.build(item_params)

    if @item.save
---
INSERT INTO "items" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Livre loup des steppes "], ["url", ""], ["content", "Canon vraiment ! "], ["user_id", 1], ["created_at", "2016-10-06 18:37:58.733702"], ["updated_at", "2016-10-06 18:37:58.733702"]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["url", "http://www.babelio.com/livres/Hesse-Le-Loup-des-steppes/2993"], ["content", ""], ["updated_at", "2016-10-06 18:39:18.844662"], ["id", 1]]

  def set_item
    @item = Item.includes(:votes).find(params[:id])
    @votes = [@item].each_with_object({}) do |item, object|
      object[item.id] = item.votes.map(&:user_id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."id" = $2  ORDER BY "items"."id" ASC LIMIT 1  [["user_id", 1], ["id", 1]]