app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "about", "salt", "crypted_password", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "about" = $1, "salt" = $2, "crypted_password" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["about", "aa"], ["salt", "CPs6cns4fQSzwp3TJBcf"], ["crypted_password", "$2a$10$mZQCqmC6McAzYmtPfS7rQey2b6TXPH4IzON6oFZGL4WHN0NA7REgi"], ["updated_at", "2016-10-06 19:54:09.462377"], ["id", 1]]

  def set_user
    @user = User.where(username: params[:id]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "etienne"]]